jurgen-kluft/rdno_espnow/source/main/cpp/c_espnow_esp8266.cpp
#if defined(TARGET_ARDUINO) && defined(TARGET_ESP8266)

#    include "rdno_core/c_debug.h"

#    include "Arduino.h"
#    include <espnow.h>
#    include <ESP8266WiFi.h>

// ----------------------------------------------------------------------------------------
// ----------------------------------------------------------------------------------------
DEBUG_TAG(RINGBUFFER_DEBUG_TAG, "RINGBUFFER");

/**
 * @brief Ring buffer class. Used to implement message buffer
 *
 */
template <typename Telement>
class RingBuffer
{
protected:
    int       maxSize;          // Buffer size
    int       numElements = 0;  // Number of elements that buffer currently has
    int       readIndex   = 0;  // Pointer to next item to be read
    int       writeIndex  = 0;  // Pointer to next position to write onto
    Telement* buffer;           // Actual buffer

public:
    /**
     * @brief Creates a ring buffer to hold `Telement` objects
     * @param range Buffer depth
     */
    RingBuffer<Telement>(int range)
        : maxSize(range)
    {
        buffer = new Telement[maxSize];
    }

    /**
     * @brief EnigmaIOTRingBuffer destructor
     * @param range Free up buffer memory
     */
    ~RingBuffer()
    {
        maxSize = 0;
        delete[] (buffer);
    }

    /**
     * @brief Returns actual number of elements that buffer holds
     * @return Returns Actual number of elements that buffer holds
     */
    int size() { return numElements; }

    /**
     * @brief Checks if buffer is full
     * @return Returns `true`if buffer is full, `false` otherwise
     */
    bool isFull() { return numElements == maxSize; }

    /**
     * @brief Checks if buffer is empty
     * @return Returns `true`if buffer has no elements stored, `false` otherwise
     */
    bool empty() { return (numElements == 0); }

    /**
     * @brief Adds a new item to buffer, deleting older element if it is full
     * @param item Element to add to buffer
     * @return Returns `false` if buffer was full before inserting the new element, `true` otherwise
     */
    bool push(Telement* item)
    {
        bool wasFull = isFull();
        DEBUG_DBG(RINGBUFFER_DEBUG_TAG, "Add element. Buffer was %s", wasFull ? "full" : "not full");
        DEBUG_DBG(RINGBUFFER_DEBUG_TAG, "Before -- > ReadIdx: %d. WriteIdx: %d. Size: %d", readIndex, writeIndex, numElements);
#    ifdef ESP32
        portMUX_TYPE myMutex = portMUX_INITIALIZER_UNLOCKED;
        portENTER_CRITICAL(&myMutex);
#    endif
        memcpy(&(buffer[writeIndex]), item, sizeof(Telement));
        // Serial.printf ("Copied: %d bytes\n", sizeof (Telement));
        writeIndex++;
        if (writeIndex >= maxSize)
        {
            writeIndex %= maxSize;
        }
        if (wasFull)
        {  // old value is no longer valid
            readIndex++;
            if (readIndex >= maxSize)
            {
                readIndex %= maxSize;
            }
        }
        else
        {
            numElements++;
        }
#    ifdef ESP32
        portEXIT_CRITICAL(&myMutex);
#    endif
        DEBUG_DBG(RINGBUFFER_DEBUG_TAG, "After -- > ReadIdx: %d. WriteIdx: %d. Size: %d", readIndex, writeIndex, numElements);
        return !wasFull;
    }

    /**
     * @brief Deletes older item from buffer, if buffer is not empty
     * @return Returns `false` if buffer was empty before trying to delete element, `true` otherwise
     */
    bool pop()
    {
        bool wasEmpty = empty();
        DEBUG_DBG(RINGBUFFER_DEBUG_TAG, "Remove element. Buffer was %s", wasEmpty ? "empty" : "not empty");
        DEBUG_DBG(RINGBUFFER_DEBUG_TAG, "Before -- > ReadIdx: %d. WriteIdx: %d. Size: %d", readIndex, writeIndex, numElements);
        if (!wasEmpty)
        {
            readIndex++;
            if (readIndex >= maxSize)
            {
                readIndex %= maxSize;
            }
            numElements--;
        }
        DEBUG_DBG(RINGBUFFER_DEBUG_TAG, "After -- > ReadIdx: %d. WriteIdx: %d. Size: %d", readIndex, writeIndex, numElements);
        return !wasEmpty;
    }

    /**
     * @brief Gets a pointer to older item in buffer, if buffer is not empty
     * @return Returns pointer to element. If buffer was empty before calling this method it returns `NULL`
     */
    Telement* front()
    {
        DEBUG_DBG(RINGBUFFER_DEBUG_TAG, "Read element. ReadIdx: %d. WriteIdx: %d. Size: %d", readIndex, writeIndex, numElements);
        if (!empty())
        {
            return &(buffer[readIndex]);
        }
        else
        {
            return NULL;
        }
    }
};

// ----------------------------------------------------------------------------------------
// ----------------------------------------------------------------------------------------

typedef std::function<void(uint8_t* address, uint8_t* data, uint8_t len, signed int rssi, bool broadcast)> comms_hal_rcvd_data;
typedef std::function<void(uint8_t* address, uint8_t status)>                                              comms_hal_sent_data;

typedef enum
{
    COMMS_SEND_OK                   = 0,  /* Data was enqued for sending successfully */
    COMMS_SEND_PARAM_ERROR          = -1, /* Data was not sent due to parameter call error */
    COMMS_SEND_PAYLOAD_LENGTH_ERROR = -2, /* Data was not sent due to payload too long */
    COMMS_SEND_QUEUE_FULL_ERROR     = -3, /* Data was not sent due to queue full */
    COMMS_SEND_MSG_ENQUEUE_ERROR    = -4, /* Data was not sent due to message queue push error */
    COMMS_SEND_CONFIRM_ERROR        = -5, /* Data was not sent due to confirmation error (only for synchronous send) */
} comms_send_error_t;

DEBUG_TAG(QESPNOW_TAG, "QESPNOW");

static const uint8_t ESPNOW_BROADCAST_ADDRESS[] = {0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF};
static const uint8_t MIN_WIFI_CHANNEL           = 0;
static const uint8_t MAX_WIFI_CHANNEL           = 14;
static const uint8_t CURRENT_WIFI_CHANNEL       = 255;  // Initialize with current channel (check your router settings)
static const size_t  ESPNOW_MAX_MESSAGE_LENGTH  = 240;  // Maximum message length
static const uint8_t ESPNOW_ADDR_LEN            = 6;    // Address length
static const uint8_t ESPNOW_QUEUE_SIZE          = 4;    // Queue size
static const int     TASK_PERIOD                = 10;   // Rx and Tx tasks period

