jurgen-kluft/rdno_espnow/source/main/cpp/c_espnow_esp8266.cpp
#    ifdef MEASURE_THROUGHPUT
static const time_t MEAS_TP_EVERY_MS = 10000;  // Measurement time period
#    endif                                     // MEASURE_THROUGHPUT

#    define ESP_NOW_ETH_ALEN     6
#    define ESP_NOW_MAX_DATA_LEN 250
#    define WIFI_IF_STA          STATION_IF
#    define WIFI_IF_AP           SOFTAP_IF

typedef enum
{
    ESP_NOW_SEND_SUCCESS = 0, /* Send ESPNOW data successfully */
    ESP_NOW_SEND_FAIL,        /* Send ESPNOW data fail */
} esp_now_send_status_t;

typedef struct
{
    uint16_t frame_head;
    uint16_t duration;
    uint8_t  destination_address[6];
    uint8_t  source_address[6];
    uint8_t  broadcast_address[6];
    uint16_t sequence_control;

    uint8_t category_code;
    uint8_t organization_identifier[3];  // 18 fe 34
    uint8_t random_values[4];
    struct
    {
        uint8_t element_id;                  // 0xdd
        uint8_t lenght;                      //
        uint8_t organization_identifier[3];  // 18 fe 34
        uint8_t type;                        // 4
        uint8_t version;
        uint8_t body[0];
    } vendor_specific_content;
} __attribute__((packed)) espnow_frame_format_t;

typedef struct
{
    uint8_t dstAddress[ESPNOW_ADDR_LEN];        /* Message topic*/
    uint8_t payload[ESPNOW_MAX_MESSAGE_LENGTH]; /* Message payload*/
    size_t  payload_len;                        /* Payload length*/
} comms_tx_queue_item_t;

typedef struct
{
    uint8_t srcAddress[ESPNOW_ADDR_LEN];        /* Source Address */
    uint8_t dstAddress[ESPNOW_ADDR_LEN];        /* Destination Address */
    uint8_t payload[ESPNOW_MAX_MESSAGE_LENGTH]; /* Message payload */
    size_t  payload_len;                        /* Payload length */
    int8_t  rssi;                               /* RSSI */
} comms_rx_queue_item_t;

// #    define MEASURE_THROUGHPUT

#    ifdef MEASURE_THROUGHPUT
static const time_t MEAS_TP_EVERY_MS = 10000;  // @brief Measurement time period

struct QuickEspNowDataThroughput
{
    void addBytesDropped(uint64_t bytes) { txDataDropped += bytes; }
    void addBytesSent(uint64_t bytes) { txDataSent += bytes; }
    void addBytesReceived(uint64_t bytes) { rxDataReceived += bytes; }

    void calculate(uint64_t now)
    {
        uint64_t measTime = (now - lastDataTPMeas);
        lastDataTPMeas    = now;

        if (txDataSent > 0)
        {
            txDataTP           = txDataSent * 1024 / measTime;
            txDroppedDataRatio = (float)txDataDropped / (float)txDataSent;
            txDataSent         = 0;
        }
        else
        {
            txDataTP           = 0;
            txDroppedDataRatio = 0;
        }

        if (rxDataReceived > 0)
        {
            rxDataTP       = rxDataReceived * 1024 / measTime;
            rxDataReceived = 0;
        }
        else
        {
            rxDataTP = 0;
        }
        txDataDropped = 0;
    }

private:
    uint64_t txDataSent         = 0;  // Total transmitted data in bytes
    uint64_t rxDataReceived     = 0;  // Total received data in bytes
    uint64_t txDataDropped      = 0;  // Total dropped transmitted data in bytes
    uint64_t lastDataTPMeas     = 0;  // Time of last throughput measurement
    float    txDataTP           = 0;  // in Kbps
    float    rxDataTP           = 0;  // in Kbps
    float    txDroppedDataRatio = 0;  // in %
};
#    else
struct QuickEspNowDataThroughput
{
    void addBytesDropped(uint64_t) {}
    void addBytesSent(uint64_t) {}
    void addBytesReceived(uint64_t) {}
    void calculate(uint64_t) {}
};
#    endif  // MEASURE_THROUGHPUT

class QuickEspNow
{
public:
    QuickEspNow()
        : tx_queue(ESPNOW_QUEUE_SIZE)
        , rx_queue(ESPNOW_QUEUE_SIZE)
    {
    }

    bool               begin(uint8_t channel = 255, uint32_t interface = 0, bool synchronousSend = true);
    void               stop();
    comms_send_error_t send(const uint8_t* dstAddress, const uint8_t* payload, size_t payload_len);
    comms_send_error_t sendBcast(const uint8_t* payload, size_t payload_len) { return send(ESPNOW_BROADCAST_ADDRESS, payload, payload_len); }
    void               onDataRcvd(comms_hal_rcvd_data dataRcvd);
    void               onDataSent(comms_hal_sent_data sentResult);
    uint8_t            getAddressLength() { return ESPNOW_ADDR_LEN; }
    uint8_t            getMaxMessageLength() { return ESPNOW_MAX_MESSAGE_LENGTH; }
    void               enableTransmit(bool enable);
    bool               setChannel(uint8_t channel);
    bool               readyToSendData();

protected:
    // uint8_t gateway[ESPNOW_ADDR_LEN]; // Gateway address
    uint8_t channel;  // Comms channel to be used

    comms_hal_rcvd_data dataRcvd   = 0;  // Pointer to a function to be called on every received message
    comms_hal_sent_data sentResult = 0;  // Pointer to a function to be called to notify last sending status
                                         // peerType_t _ownPeerType; // Stores peer type, node or gateway
    uint8_t  wifi_if;
    ETSTimer espnowTxTask;
    ETSTimer espnowRxTask;

    bool    readyToSend            = true;
    bool    waitingForConfirmation = false;
    bool    synchronousSend        = false;
    bool    followWiFiChannel      = false;
    int     queueSize              = ESPNOW_QUEUE_SIZE;
    uint8_t sentStatus;

    QuickEspNowDataThroughput dataThroughput;

    RingBuffer<comms_tx_queue_item_t> tx_queue;
    RingBuffer<comms_rx_queue_item_t> rx_queue;

    void        initComms();
    static void espnowTxTask_cb(void* param);
    static void espnowRxTask_cb(void* param);
    int32_t     sendEspNowMessage(comms_tx_queue_item_t* message);
    void        espnowTxHandle();
    void        espnowRxHandle();

    static void ICACHE_FLASH_ATTR rx_cb(uint8_t* mac_addr, uint8_t* data, uint8_t len);
    static void ICACHE_FLASH_ATTR tx_cb(uint8_t* mac_addr, uint8_t status);
};

typedef struct
{
    signed   rssi : 8;
    unsigned rate : 4;
    unsigned is_group : 1;
    unsigned : 1;
    unsigned sig_mode : 2;
    unsigned legacy_length : 12;
    unsigned damatch0 : 1;
    unsigned damatch1 : 1;
    unsigned bssidmatch0 : 1;
    unsigned bssidmatch1 : 1;
    unsigned MCS : 7;
    unsigned CWB : 1;
    unsigned HT_length : 16;
    unsigned Smoothing : 1;
    unsigned Not_Sounding : 1;
    unsigned : 1;
    unsigned Aggregation : 1;
    unsigned STBC : 2;
    unsigned FEC_CODING : 1;
    unsigned SGI : 1;
    unsigned rxend_state : 8;
    unsigned ampdu_cnt : 8;
    unsigned channel : 4;
    unsigned : 12;
} wifi_pkt_rx_ctrl_t;

typedef struct
{
    wifi_pkt_rx_ctrl_t rx_ctrl;
    uint8_t            payload[0]; /* ieee80211 packet buff */
} wifi_promiscuous_pkt_t;

QuickEspNow quickEspNow;

bool QuickEspNow::begin(uint8_t channel, uint32_t wifi_interface, bool synchronousSend)
{
    this->synchronousSend = synchronousSend;

    DEBUG_DBG(QESPNOW_TAG, "Channel: %d, Interface: %d", channel, wifi_interface);
    // Set the wifi interface
    switch (wifi_interface)
    {
        case WIFI_IF_STA: wifi_if = WIFI_IF_STA; break;
        case WIFI_IF_AP: wifi_if = WIFI_IF_AP; break;
        default:
            DEBUG_ERROR(QESPNOW_TAG, "Unknown wifi interface");
            return false;
            break;
    }

