jurgen-kluft/rdno_espnow/source/main/cpp/c_espnow_esp8266.cpp
    // check channel
    if (channel != CURRENT_WIFI_CHANNEL && (channel < MIN_WIFI_CHANNEL || channel > MAX_WIFI_CHANNEL))
    {
        DEBUG_ERROR(QESPNOW_TAG, "Invalid wifi channel %d", channel);
        return false;
    }

    // use current channel
    if (channel == CURRENT_WIFI_CHANNEL)
    {
        uint8_t ch;
        ch = WiFi.channel();
        DEBUG_DBG(QESPNOW_TAG, "Current channel: %d", ch);
        channel           = ch;
        followWiFiChannel = true;
    }
    else
    {
        setChannel(channel);
    }
    DEBUG_INFO(QESPNOW_TAG, "Starting ESP-NOW using channel %u, interface %s", channel, wifi_if == WIFI_IF_STA ? "STA" : "AP");

    this->channel = channel;
    initComms();
    // addPeer (ESPNOW_BROADCAST_ADDRESS); // Not needed ?
    return true;
}

void QuickEspNow::stop()
{
    DEBUG_INFO(QESPNOW_TAG, "Stop ESP-NOW");
    os_timer_disarm(&espnowTxTask);
    os_timer_disarm(&espnowRxTask);
    esp_now_unregister_recv_cb();
    esp_now_unregister_send_cb();
    esp_now_deinit();
}

bool QuickEspNow::readyToSendData() { return tx_queue.size() < queueSize; }

bool QuickEspNow::setChannel(uint8_t channel)
{
    if (followWiFiChannel)
    {
        DEBUG_WARN(QESPNOW_TAG, "Cannot set channel while following WiFi channel");
        return false;
    }

    if (!wifi_set_channel(channel))
    {
        DEBUG_ERROR(QESPNOW_TAG, "Error setting wifi channel: %u", channel);
        return false;
    }

    this->channel = channel;

    return true;
}

comms_send_error_t QuickEspNow::send(const uint8_t* dstAddress, const uint8_t* payload, size_t payload_len)
{
    comms_tx_queue_item_t message;

    if (!dstAddress || !payload || !payload_len)
    {
        DEBUG_WARN(QESPNOW_TAG, "Parameters error");
        return COMMS_SEND_PARAM_ERROR;
    }

    if (payload_len > ESP_NOW_MAX_DATA_LEN)
    {
        DEBUG_WARN(QESPNOW_TAG, "Length error. %d", payload_len);
        return COMMS_SEND_PAYLOAD_LENGTH_ERROR;
    }

    if (tx_queue.size() >= ESPNOW_QUEUE_SIZE)
    {
#    ifdef MEASURE_THROUGHPUT
        // comms_tx_queue_item_t* tempBuffer;
        // tempBuffer = tx_queue.front ();
        // txDataDropped += tempBuffer->payload_len;
#    endif  // MEASURE_THROUGHPUT
            // tx_queue.pop ();
            // DEBUG_DBG (QESPNOW_TAG, "Message dropped");
        return COMMS_SEND_QUEUE_FULL_ERROR;
    }

    memcpy(message.dstAddress, dstAddress, ESP_NOW_ETH_ALEN);
    message.payload_len = payload_len;
    memcpy(message.payload, payload, payload_len);

    if (tx_queue.push(&message))
    {
#    ifdef MEASURE_THROUGHPUT
        txDataSent += message.payload_len;
#    endif  // MEASURE_THROUGHPUT
        DEBUG_DBG(QESPNOW_TAG, "--------- %d Comms messages queued. Len: %d", tx_queue.size(), payload_len);
        DEBUG_VERBOSE(QESPNOW_TAG, "--------- Ready to send is %s", readyToSend ? "true" : "false");
        if (synchronousSend)
        {
            waitingForConfirmation = true;
            DEBUG_INFO(QESPNOW_TAG, "--------- Waiting for send confirmation");
            while (waitingForConfirmation)
            {
                esp_yield();
            }
            DEBUG_INFO(QESPNOW_TAG, "--------- Confirmation is %s", sentStatus == ESP_NOW_SEND_SUCCESS ? "true" : "false");
            return (sentStatus == ESP_NOW_SEND_SUCCESS) ? COMMS_SEND_OK : COMMS_SEND_CONFIRM_ERROR;
        }
        return COMMS_SEND_OK;
    }
    else
    {
        DEBUG_WARN(QESPNOW_TAG, "Error queuing Comms message to " MACSTR, MAC2STR(dstAddress));
        return COMMS_SEND_MSG_ENQUEUE_ERROR;
    }
}

void QuickEspNow::onDataRcvd(comms_hal_rcvd_data dataRcvd) { this->dataRcvd = dataRcvd; }

#    ifdef MEASURE_THROUGHPUT
void QuickEspNow::calculateDataTP()
{
    time_t measTime = (millis() - lastDataTPMeas);
    lastDataTPMeas  = millis();

    if (txDataSent > 0)
    {
        txDataTP = txDataSent * 1000 / measTime;
        // DEBUG_WARN(QESPNOW_TAG, "Meas time: %d, Data sent: %d, Data TP: %f", measTime, txDataSent, txDataTP);
        txDroppedDataRatio = (float)txDataDropped / (float)txDataSent;
        // DEBUG_WARN(QESPNOW_TAG, "Data dropped: %d, Drop ratio: %f", txDataDropped, txDroppedDataRatio);
        txDataSent = 0;
    }
    else
    {
        txDataTP           = 0;
        txDroppedDataRatio = 0;
    }
    if (rxDataReceived > 0)
    {
        rxDataTP = rxDataReceived * 1000 / measTime;
        // DEBUG_WARN(QESPNOW_TAG, "Meas time: %d, Data received: %d, Data TP: %f", measTime, rxDataReceived, rxDataTP);
        rxDataReceived = 0;
    }
    else
    {
        rxDataTP = 0;
    }
    txDataDropped = 0;
}

void QuickEspNow::tp_timer_cb(void* param)
{
    quickEspNow.calculateDataTP();
    DEBUG_WARN(QESPNOW_TAG, "TxData TP: %.3f kbps, Drop Ratio: %.2f %%, RxDataTP: %.3f kbps", quickEspNow.txDataTP * 8 / 1000, quickEspNow.txDroppedDataRatio * 100, quickEspNow.rxDataTP * 8 / 1000);
}
#    endif  // MEASURE_THROUGHPUT

void QuickEspNow::onDataSent(comms_hal_sent_data sentResult) { this->sentResult = sentResult; }

int32_t QuickEspNow::sendEspNowMessage(comms_tx_queue_item_t* message)
{
    int32_t error;

    if (!message)
    {
        DEBUG_WARN(QESPNOW_TAG, "Message is null");
        return -1;
    }
    if (!(message->payload_len) || (message->payload_len > ESP_NOW_MAX_DATA_LEN))
    {
        DEBUG_WARN(QESPNOW_TAG, "Message length error");
        return -1;
    }

    DEBUG_VERBOSE(QESPNOW_TAG, "ESP-NOW message to " MACSTR, MAC2STR(message->dstAddress));

    readyToSend = false;
    DEBUG_VERBOSE(QESPNOW_TAG, "-------------- Ready to send: false");

    error = esp_now_send(message->dstAddress, message->payload, message->payload_len);
    DEBUG_DBG(QESPNOW_TAG, "esp now send result = %d", error);

    return error;
}

void QuickEspNow::espnowTxHandle()
{
    if (readyToSend)
    {
        // DEBUG_WARN ("Process queue: Elements: %d", tx_queue.size ());
        comms_tx_queue_item_t* message;
        while (!tx_queue.empty())
        {
            if (!readyToSend)
                return;
            message = tx_queue.front();
            DEBUG_DBG(QESPNOW_TAG, "Comms message got from queue. %d left", tx_queue.size());
            DEBUG_VERBOSE(QESPNOW_TAG, "Ready to send is %s", readyToSend ? "true" : "false");
            DEBUG_VERBOSE(QESPNOW_TAG, "synchrnousSend is %s", synchronousSend ? "true" : "false");
            if (!sendEspNowMessage(message))
            {
                DEBUG_DBG(QESPNOW_TAG, "Message to " MACSTR " sent. Len: %u", MAC2STR(message->dstAddress), message->payload_len);
            }
            else
            {
                DEBUG_WARN(QESPNOW_TAG, "Error sending message to " MACSTR ". Len: %u", MAC2STR(message->dstAddress), message->payload_len);
            }
            message->payload_len = 0;
            tx_queue.pop();
            DEBUG_DBG(QESPNOW_TAG, "Comms message pop. Queue size %d", tx_queue.size());
        }
    }
    else
    {
        DEBUG_DBG(QESPNOW_TAG, "Not ready to send");
    }
}

void QuickEspNow::enableTransmit(bool enable)
{
    DEBUG_DBG(QESPNOW_TAG, "Send esp-now task %s", enable ? "enabled" : "disabled");
    if (enable)
    {
        os_timer_arm(&espnowTxTask, TASK_PERIOD, true);
        os_timer_arm(&espnowRxTask, TASK_PERIOD, true);
    }
    else
    {
        os_timer_disarm(&espnowTxTask);
        os_timer_disarm(&espnowRxTask);
    }
}

void QuickEspNow::initComms()
{
    if (esp_now_init())
    {
        DEBUG_ERROR(QESPNOW_TAG, "Failed to init ESP-NOW");
        ESP.restart();
        delay(1);
    }

