jurgen-kluft/rdno_espnow/source/main/cpp/c_espnow_esp8266.cpp
    if (wifi_if == WIFI_IF_STA)
    {
        esp_now_set_self_role(ESP_NOW_ROLE_SLAVE);
    }
    else
    {
        esp_now_set_self_role(ESP_NOW_ROLE_CONTROLLER);
    }

    esp_now_register_recv_cb(rx_cb);
    esp_now_register_send_cb(tx_cb);

    os_timer_setfn(&espnowTxTask, espnowTxTask_cb, NULL);
    os_timer_arm(&espnowTxTask, TASK_PERIOD, true);

    os_timer_setfn(&espnowRxTask, espnowRxTask_cb, NULL);
    os_timer_arm(&espnowRxTask, TASK_PERIOD, true);

#    ifdef MEASURE_THROUGHPUT
    os_timer_setfn(&dataTPTimer, tp_timer_cb, NULL);
    os_timer_arm(&dataTPTimer, MEAS_TP_EVERY_MS, true);
#    endif  // MEASURE_THROUGHPUT
}

void QuickEspNow::espnowTxTask_cb(void* param) { quickEspNow.espnowTxHandle(); }

void QuickEspNow::rx_cb(uint8_t* mac_addr, uint8_t* data, uint8_t len)
{
    espnow_frame_format_t*  espnow_data     = (espnow_frame_format_t*)(data - sizeof(espnow_frame_format_t));
    wifi_promiscuous_pkt_t* promiscuous_pkt = (wifi_promiscuous_pkt_t*)(data - sizeof(wifi_pkt_rx_ctrl_t) - sizeof(espnow_frame_format_t));
    wifi_pkt_rx_ctrl_t*     rx_ctrl         = &promiscuous_pkt->rx_ctrl;

    comms_rx_queue_item_t message;

    DEBUG_DBG(QESPNOW_TAG, "Received message with RSSI %d from " MACSTR " Len: %u", rx_ctrl->rssi, MAC2STR(mac_addr), len);

    memcpy(message.srcAddress, mac_addr, ESP_NOW_ETH_ALEN);
    memcpy(message.payload, data, len);
    message.payload_len = len;
    message.rssi        = rx_ctrl->rssi - 100;
    memcpy(message.dstAddress, espnow_data->destination_address, ESP_NOW_ETH_ALEN);

    if (quickEspNow.rx_queue.size() >= ESPNOW_QUEUE_SIZE)
    {
        quickEspNow.tx_queue.pop();
        DEBUG_DBG(QESPNOW_TAG, "Rx Message dropped");
    }

#    ifdef MEASURE_THROUGHPUT
    quickEspNow.rxDataReceived += len;
#    endif  // MEASURE_THROUGHPUT

    if (quickEspNow.rx_queue.push(&message))
    {
        DEBUG_DBG(QESPNOW_TAG, "Message pushed to queue");
    }
    else
    {
        DEBUG_WARN(QESPNOW_TAG, "Error queuing message");
    }
}

void QuickEspNow::espnowRxTask_cb(void* param) { quickEspNow.espnowRxHandle(); }

void QuickEspNow::espnowRxHandle()
{
    comms_rx_queue_item_t* rxMessage;

    if (!rx_queue.empty())
    {
        rxMessage = rx_queue.front();
        DEBUG_DBG(QESPNOW_TAG, "Comms message got from queue. %d left", rx_queue.size());
        DEBUG_VERBOSE(QESPNOW_TAG, "Received message from " MACSTR " Len: %u", MAC2STR(rxMessage->srcAddress), rxMessage->payload_len);
        DEBUG_VERBOSE(QESPNOW_TAG, "Message: %.*s", rxMessage->payload_len, rxMessage->payload);

        if (quickEspNow.dataRcvd)
        {
            bool broadcast = !memcmp(rxMessage->dstAddress, ESPNOW_BROADCAST_ADDRESS, ESP_NOW_ETH_ALEN);
            // quickEspNow.dataRcvd (mac_addr, data, len, rx_ctrl->rssi - 98); // rssi should be in dBm but it has added almost 100 dB. Do not know why
            quickEspNow.dataRcvd(rxMessage->srcAddress, rxMessage->payload, rxMessage->payload_len, rxMessage->rssi, broadcast);  // rssi should be in dBm but it has added almost 100 dB. Do not know why
        }

        rxMessage->payload_len = 0;
        rx_queue.pop();
        DEBUG_DBG(QESPNOW_TAG, "RX Comms message pop. Queue size %d", rx_queue.size());
    }
}

void QuickEspNow::tx_cb(uint8_t* mac_addr, uint8_t status)
{
    quickEspNow.readyToSend = true;
    quickEspNow.sentStatus  = status;
    DEBUG_DBG(QESPNOW_TAG, "-------------- Tx Confirmed %s", status == ESP_NOW_SEND_SUCCESS ? "true" : "false");
    quickEspNow.waitingForConfirmation = false;
    DEBUG_DBG(QESPNOW_TAG, "-------------- Ready to send: true");
    if (quickEspNow.sentResult)
    {
        quickEspNow.sentResult(mac_addr, status);
    }
}

namespace ncore
{
    namespace nespnow
    {

    }  // namespace nespnow
}  // namespace ncore

#endif
